Pontif√≠cia Universidade Cat√≥lica de S√£o Paulo 

`Ci√™ncia de Dados e Intelig√™ncia Artificial`

üéì Aula 2 - Processamento de Dados em Python usando Pandas

---
> üë®‚Äçüè´*Professor Rooney Coelho (rracoelho@pucsp.br)*
---

In [2]:
# Inicialmente execute este bloco para as depend√™ncias
import pandas as pd

### 1) Dado o seguinte `DataFrame`, fa√ßa o que se pede:

In [3]:
# Aperte Ctrl+Enter
df = pd.DataFrame({'a':[11,21,31],'b':[21,22,23]})

a) Mostre as tr√™s primeiras linhas de df

In [4]:
df.head(3)

    a   b
0  11  21
1  21  22
2  31  23

b) Obtenha a coluna 'a'

In [5]:
df.a

0    11
1    21
2    31
Name: a, dtype: int64

### 2) Dado o seguinte DataFrame, fa√ßa o que se pede:

In [6]:
# Aperte Ctrl+Enter
df = pd.DataFrame({'a':[1,2,1],'b':[1,1,1]})

a) Identifique os valores √∫nicos na coluna `a`.

In [7]:
df.a.unique()

array([1, 2])

b) Retorne um `Dataframe` com linhas somente onde a coluna `a` √© menor que 2.

In [8]:
df[df.a < 2]

   a  b
0  1  1
2  1  1

### 3) Carregue o Dataset do Titanic e fa√ßa o que se pede.

In [9]:
# Aperte Ctrl+Enter para carregar o Dataset
df = pd.read_csv("http://bit.ly/kaggletrain")

a) Confira os dados imprimindo o seu cabe√ßalho.

In [11]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

b) Confira se a coluna `PassengerId` e veja se todos os seus valores s√£o √∫nicos.

In [14]:
df.PassengerId.unique().shape[0] == df.shape[0]

True

b) Confira se a coluna `Ticket` possui e veja se todos os seus valores s√£o √∫nicos.

In [15]:
df.Ticket.unique().shape[0] == df.shape[0]

False

c) Torne a coluna `PassengerId` a chave prim√°ria de df.

In [16]:
df.set_index('PassengerId', inplace=True)

d) Utilize um m√©todo para a estat√≠stica descritiva desse `Dataset`

In [17]:
df.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

### 4) Fa√ßa o que se pede.

a) Imprima os dados da pessoa mais velha que estava no navio.

In [19]:
df.sort_values('Age', ascending=False).head(1)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0,A23,S

b) Imprima os dados do passageiro cujo n√∫mero do √≠ndice √© 789

In [22]:
df.iloc[789]

Survived                           0
Pclass                             1
Name        Guggenheim, Mr. Benjamin
Sex                             male
Age                             46.0
SibSp                              0
Parch                              0
Ticket                      PC 17593
Fare                            79.2
Cabin                        B82 B84
Embarked                           C
Name: 790, dtype: object

c) Um historiador encontrou o `Ticket` 17474 do Titanic. Localize esse passageiro para entrar em contato com seus familiares e notific√°-los desse achado. Essa pessoa sobreviveu?

In [25]:
df.loc[df.Ticket == "17474"]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
691,1,1,"Dick, Mr. Albert Adrian",male,31.0,1,0,17474,57.0,B20,S
782,1,1,"Dick, Mrs. Albert Adrian (Vera Gillespie)",female,17.0,1,0,17474,57.0,B20,S

### 5) Para as tr√™s classes, fa√ßa o que se pede.

a) Quantas pessoas est√£o na Primeira, Segunda e Terceira classes? Use a coluna `Pclass` para isso.

In [27]:
df.Pclass.value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

b) Qual a m√©dia de idade dos sobreviventes das tr√™s classes? Use o m√©todo `groupby` para isso.

In [29]:
df.groupby('Pclass').Age.mean()

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

c) Qual a m√©dia de idade das pessoas que sobreviveram e morreram nas tr√™s classes? Use o m√©todo `groupby` para isso (note que s√£o dois agrupamentos).

In [32]:
df[df.Survived == 1].groupby('Pclass').Age.mean()

Pclass
1    35.368197
2    25.901566
3    20.646118
Name: Age, dtype: float64

d) Qual a m√©dia de idade das pessoas de cada sexo que sobreviveram e morreram nas tr√™s classes? Use o m√©todo `groupby` para isso (note que s√£o tr√™s agrupamentos).

In [36]:
df.groupby(["Pclass", "Sex", "Survived"]).Age.mean()

Pclass  Sex     Survived
1       female  0           25.666667
                1           34.939024
        male    0           44.581967
                1           36.248000
2       female  0           36.000000
                1           28.080882
        male    0           33.369048
                1           16.022000
3       female  0           23.818182
                1           19.329787
        male    0           27.255814
                1           22.274211
Name: Age, dtype: float64

### 6) Use o m√©todo `replace` para mudar a coluna `Survived` pela correspond√™ncia do seguinte dicion√°rio:

```python
di = {0: False, 1: True}
```

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.replace.html

In [37]:
di = {0: False, 1: True}
df.Survived.replace(di, inplace=True)
df.Survived.value_counts()

False    549
True     342
Name: Survived, dtype: int64